{   
    "jobs": [
        {
            "date": "Jul 2022 to Aug 2023",
            "company": "Back of New York Mellon",
            "post": "Software Engineer",
            "location": "Pune, India",
            "description": [
                "• Worked on backend REST APIs of an electronic signature app using Java SpringBoot, serving 60,000+ users, including company employees and clients to facilitate digital signatures.",
                "• Leveraged Apache Kafka to manage continuous data streams, Amazon S3 for document storage, and Oracle MySQL for user data storage.",
                "• Implemented scrum/agile methodologies to enhance CI/CD, boosting Java code coverage by 60% using JUnit and Mockito and addressing 100+ production bugs."
            ]
        }
    ],

    "internships" : [
        {
            "date": "Aug 2021 to May 2022",
            "company": "Veritas Technologies LLC",
            "post": "Research Project Intern",
            "location": "Pune, India",
            "description": [
                "• Devised an NLP text classification model based on LSTM and Google’s LLM - BERT for auto-matching relevant documents. Used rehearsal techniques for effective training, preventing memory loss issues while training model.",
                "• Improved incremental learning accuracy by 45% by writing a ranking algorithm prioritizing uncertain documents.",
                "• Developed this web application using Django REST APIs in Python and React.js, the backend was dockerized and deployed to AWS EC2 servers ensuring scalable and efficient access to the application."
            ]
        },
        {
            "date": "Jan 2021 to Mar 2021",
            "company": "Acumensa Technologies Pvt. Ltd.",
            "post": "Software Developer Intern",
            "location": "Bangalore, India",
            "description": [
                "• Built a Supply Chain Management software, using Django REST APIs and ReactJS.",
                "• This project provides multiple features for producers, consumers, suppliers, and sellers. And, also solves the existing problem of backtracking if any error is found in goods, Implemented the permission and approval frameworks using the workflow model."
            ]
        },
        {
            "date": "May 2019 to July 2019",
            "company": "Indian Institute of Management, Ahmedabad",
            "post": "Summer Intern",
            "location": "Ahmedabad, India",
            "description": [
                "Contributed to a finance education website using HTML, CSS, and Javascript. Conducted data visualization using Python’s pandas, matplotlib, and seaborn libraries on information sourced from public APIs."
            ]
        }    
    ],

    "volunteer": [
        {
            "company": "PICT IEEE Student Branch",
            "position": "Technical Head",
            "date": "Sep 2018 - Aug 2021",
            "description": [
                "• Led a team of 300+ active student members, fostering technical engagement and collaboration.",
                "• Organized Credenz '19, a successful college Tech Fest, showcasing innovative projects and workshops.",
                "• Conducted Special Interest Groups (SIGs) and technical talks to enhance student knowledge and skills."
            ]
        },
        {
            "company": "Teach For India",
            "position": "Teaching Assistant",
            "date": "Oct'19 - Mar'20",
            "description": [
                "My Role as Volunteer:",
                "• Facilitated interactive and engaging lectures on subjects including Mathematics, Science, and Geography to a diverse group of students.",
                "• Created and administered question papers to assess students' understanding and proficiency in the respective subjects.",
                "• Conducted thorough evaluation of answer papers, providing constructive feedback to students to facilitate their academic growth and development."
            ]
        },
        {
            "company": "Mozilla and MLpack",
            "position": "Open Source Developer",
            "date": "Oct 2020 - Dec 2020",
            "description": [
                "Solved issues(website bugs) and created more than ten pull requests to solve them, on the Mozilla support website."
            ]
        }
    ]
}
